app/Controllers/usuario_controller.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `email`, `usuario`, `telefono`, `pass`) VALUES ('Paula', 'Muñoz', 'paulam34@gmail.com', 'paula32', '3795127400', '$2y$10$nEMSdBPRE7rIOu9od0KQs.xt5M793DCKaefFj8jnBRd6h9qfNgEcW')
---
    public function formValidation(){
        $input = $this-> validate([
            'nombre' => 'required|min_length[3]',
            'apellido' => 'required|min_length[3]|max_length[50]',
            'email' => 'required|min_length[3]|max_length[100]|valid_email|is_unique[usuarios.email]',
            'usuario' => 'required|min_length[3]|is_unique[usuarios.usuario]',
            'telefono' => 'required|min_length[3]|numeric',
            'pass' => 'required|min_length[3]|max_length[100]',

        ],
    );

    $formModel = new usuario_Model();

    if(!$input){
        $data['title']= 'Registro';
        echo view('front/header', $data);
        echo view('front/navbar');
        echo view('back/usuario/registro', ['validation' => $this->validator]);
        echo view('front/footer');
    }else{
        $formModel->save([
            'nombre' => $this->request->getVar('nombre'),
            'apellido' => $this->request->getVar('apellido'),
            'email' => $this->request->getVar('email'),
            'usuario' => $this->request->getVar('usuario'),
            'telefono' => $this->request->getVar('telefono'),
            'pass' => password_hash($this->request->getVar('pass'), PASSWORD_BCRYPT),
        ]);